<a href="https://colab.research.google.com/github/LeeM21/DateBase/blob/master/%EC%9D%91%EC%9A%A95/4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
path = '/A 학교출신 지원자.csv'

In [4]:
df = pd.read_csv(path, encoding='cp949')
df.head()

  출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
0    A  30104  조매미  70  66  78   38   42
1    A  30115  김개미  71  77  89   15   20
2    A  30117  박모기  76  55  75   35   30
3    A  30120  최파리  69  66  51   15   36
4    A  30215  정땅벌  63  20  76   15   19

In [6]:
df.tail()

   출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
24    A  30822  조황돔  84  88  76   37   37
25    A  30824  백돌돔  83  88  80   30   30
26    A  30827  허대구  95  70  67   35   29
27    A  30901  유명태  87  69  96   37   40
28    A  30928  남동태  91  50  80   29   26

In [8]:
df.info

<bound method DataFrame.info of    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
0     A  30104  조매미  70  66  78   38   42
1     A  30115  김개미  71  77  89   15   20
2     A  30117  박모기  76  55  75   35   30
3     A  30120  최파리  69  66  51   15   36
4     A  30215  정땅벌  63  20  76   15   19
5     A  30228  오멸치  67  51  48   21   12
6     A  30229  김꿀벌  93  77  78   33   44
7     A  30305  윤여치  88  66  70   41   21
8     A  30315  장곱등  86  66  84   35   38
9     A  30317  임나방  73  77  75   32   25
10    A  30319  한말벌  84  65  75   42   26
11    A  30401  강나비  68  80  72   10   12
12    A  30404  서삼치  88  65  86   41   37
13    A  30421  신참치  98  92  85   44   35
14    A  30428  권갈치  91  74  83   38   42
15    A  30503  황넙치  73  70  76   35   33
16    A  30512  안준치  84  77  66   19   23
17    A  30518  송날치  90  56  61   20   33
18    A  30529  전꽁치  79  46  68   34   34
19    A  30622  유쥐치  95  85  91   38   32
20    A  30707  고조기  57  69  72    8   18
21    A  30709  문메기  72  77  91   18   33
22    A  30803  손뿔돔  71  80  48   34   29
23    A  30815  배옥돔  49  70  31   12   21
24    A  30822  조황돔  84  88  76   37   37
25    A  30824  백돌돔  83  88  80   30   30
26    A  30827  허대구  95  70  67   35   29
27    A  30901  유명태  87  69  96   37   40
28    A  30928  남동태  91  50  80   29   26>

In [11]:
df['과탐1'].head()

0    38
1    15
2    35
3    15
4    15
Name: 과탐1, dtype: int64

In [16]:
df['과탐평균']= df['과탐1']*0.5+df['과탐2']*0.5
df[['과탐평균']]

    과탐평균
0   40.0
1   17.5
2   32.5
3   25.5
4   17.0
5   16.5
6   38.5
7   31.0
8   36.5
9   28.5
10  34.0
11  11.0
12  39.0
13  39.5
14  40.0
15  34.0
16  21.0
17  26.5
18  34.0
19  35.0
20  13.0
21  25.5
22  31.5
23  16.5
24  37.0
25  30.0
26  32.0
27  38.5
28  27.5

In [19]:
df.head()

  출신고교     학번   이름  국어  수학  영어  과탐1  과탐2  과탐평균
0    A  30104  조매미  70  66  78   38   42  40.0
1    A  30115  김개미  71  77  89   15   20  17.5
2    A  30117  박모기  76  55  75   35   30  32.5
3    A  30120  최파리  69  66  51   15   36  25.5
4    A  30215  정땅벌  63  20  76   15   19  17.0

In [24]:

re = (lambda a: a+10)(1) 
re

11

In [25]:
a=[3,5,11,100]
a

[3, 5, 11, 100]

In [26]:
max(a)

100

In [30]:
f = lambda x, y : x+y
f(5,10)

15

In [34]:
max_lam = (lambda a : max(a))
print(a)
max_lam(a)

[3, 5, 11, 100]

100

In [35]:
df[['과탐1', '과탐2']]

    과탐1  과탐2
0    38   42
1    15   20
2    35   30
3    15   36
4    15   19
5    21   12
6    33   44
7    41   21
8    35   38
9    32   25
10   42   26
11   10   12
12   41   37
13   44   35
14   38   42
15   35   33
16   19   23
17   20   33
18   34   34
19   38   32
20    8   18
21   18   33
22   34   29
23   12   21
24   37   37
25   30   30
26   35   29
27   37   40
28   29   26

In [41]:
df['과탐상위']=df[['과탐1','과탐2']].apply(lambda a : max(a),axis=1)
df[['과탐상위']].head()

   과탐상위
0    42
1    20
2    35
3    36
4    19

axis=0 행
axis=1 열

In [43]:
df['변환점수']=df['국어']*0.2+df['수학']*0.4+(df['과탐1']+df['과탐2'])*0.4
df[['변환점수']].head()

   변환점수
0  72.4
1  59.0
2  63.2
3  60.6
4  34.2

In [45]:
df.head()

  출신고교     학번   이름  국어  수학  영어  과탐1  과탐2  과탐평균  과탐상위  변환점수
0    A  30104  조매미  70  66  78   38   42  40.0    42  72.4
1    A  30115  김개미  71  77  89   15   20  17.5    20  59.0
2    A  30117  박모기  76  55  75   35   30  32.5    35  63.2
3    A  30120  최파리  69  66  51   15   36  25.5    36  60.6
4    A  30215  정땅벌  63  20  76   15   19  17.0    19  34.2